<template>
  <h3>更新履歴</h3>

  <h4>2025/01/05</h4>
  <ul>
    <li>改善: 何待ち100本ノックに振り返り機能を追加</li>
    <li>変更: スマートフォンのときに折り返されていた手牌を横スクロールで表示するよう変更</li>
  </ul>

  <h4>2025/01/04</h4>
  <ul>
    <li>追加: 何待ち100本ノック</li>
  </ul>

  <h4>2025/01/01</h4>
  <ul>
    <li>改善: キーボードショートカットを追加</li>
  </ul>

  <h4>2024/04/16</h4>
  <ul>
    <li>改善: 何待ちの解説を見やすくリニューアル</li>
    <li>改善: 何待ちのタイトルを設定に応じて変更</li>
    <li>変更: 4枚使いの5枚目をデフォルトでは回答に含まないよう変更（設定で変更可）</li>
  </ul>

  <h4>2024/04/14</h4>
  <ul>
    <li>改善: 設定を変更せずに設定モーダルを閉じたとき、問題を保持するよう修正</li>
    <li>改善: わかりやすくなるよう、説明を追加・見直し</li>
  </ul>
  <h4>2024/02/05</h4>
  <ul>
    <li>不具合修正: 何待ちモードで七対子の有効牌が一部誤っていた問題を修正</li>
    <li>改善: 「塔子」 → 「搭子」 と表記を修正</li>
  </ul>
  <h4>2024/01/25</h4>
  <ul>
    <li>改善: ノーテン問題の出題可能範囲を拡大</li>
    <li>
      不具合修正:
      「何待ち」モードのレアケースに対応(4枚使いイーシャンテンで雀頭がないときに、引いてきた牌全てでテンパイするケース)
    </li>
  </ul>
  <h4>2024/01/24</h4>
  <ul>
    <li>不具合修正: 4枚使いの手牌の判定が誤っていた問題を修正</li>
  </ul>
  <h4>2024/01/23</h4>
  <ul>
    <li>改善: ノーテン問題の生成速度を改善</li>
    <li>改善: 設定の一部を変更</li>
    <li>不具合修正: 範囲「3-7」に8の牌が入ってくる不具合を修正</li>
  </ul>
  <h4>2024/01/20</h4>
  <ul>
    <li>公開</li>
  </ul>
</template>
<style scoped>
h3 {
  @apply mb-3 mt-7 text-xl font-extrabold;
}
h4 {
  @apply mb-2 mt-4 font-semibold;
}
ul {
  @apply mx-5 list-outside list-disc space-y-1;
}
</style>
